#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
cloudflare_tunnel.kubernetes: Refreshing state... [id=9663fcd3-ee94-40b9-95ec-a74ec54a7610]
data.pagerduty_user.me: Reading...
data.azuread_user.admin: Reading...
data.azuread_user.e2e_admin: Reading...
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_client_config.current: Reading...
data.azuread_user.e2e_nonadmin_user: Reading...
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_client_config.current: Read complete after 0s [id=53174009-29d5-4c20-8bd0-0e2b2b0de6a8-1e4ad037-574d-4fba-a5c3-ed6c85fda2f5-4a8185bf-54b9-4d21-a286-fb744d13c64d]
cloudflare_record.apps["Homepage"]: Refreshing state... [id=4b13b8b667a4f6d4b59f0dccea3986e4]
cloudflare_record.apps["Kubernetes dashboard"]: Refreshing state... [id=68265092b7539d0c0c11a104ac8914e8]
cloudflare_record.apps["Proxmox VE"]: Refreshing state... [id=fde116e796dfee8778b668c4e57a877e]
cloudflare_record.apps["Argo CD"]: Refreshing state... [id=a1abf9a1ebb4b7cfdcd6e2d0b53fa9d9]
cloudflare_record.apps["CyberChef"]: Refreshing state... [id=3e285514c143f57e4ad4232bc085fb96]
azuread_service_principal.msgraph: Refreshing state... [id=2bc0e2df-4abf-4297-a53b-4e304da70187]
cloudflare_record.apps["Login"]: Refreshing state... [id=54e15f8537e8952b0bd0184f81f9f773]
cloudflare_record.ssh["pve1"]: Refreshing state... [id=1c8fd3d475ee3ab13338d816fbf945f1]
cloudflare_record.ssh["pve2"]: Refreshing state... [id=d9c4dded37e64ae2829740a37cedcc1f]
data.azuread_user.e2e_admin: Read complete after 1s [id=9b910c80-61bc-4df7-bf4b-77cb05ba057c]
cloudflare_record.ssh["pve3"]: Refreshing state... [id=f862705e50cea8654dd564898ddf4c01]
data.azuread_user.admin: Read complete after 1s [id=74953878-8eaf-421b-b557-b2485367566c]
azuread_group.administrators: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e]
azuread_group.users: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d]
data.pagerduty_user.me: Read complete after 1s [id=PT33KZP]
data.azuread_user.e2e_nonadmin_user: Read complete after 2s [id=bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40]
azuread_group_member.administrators_e2e_admin: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/9b910c80-61bc-4df7-bf4b-77cb05ba057c]
azuread_group_member.administrators_admin: Refreshing state... [id=64d004bd-9218-4fae-9919-0505ff5eeb8e/member/74953878-8eaf-421b-b557-b2485367566c]
azuread_application.pomerium: Refreshing state... [id=1feb9fee-6af3-49b5-bb3f-2fb68ea03958]
azuread_application.proxmox: Refreshing state... [id=16399057-32a8-4025-bdea-fa59b7022326]
azuread_application.cloudflare: Refreshing state... [id=c8f4f59b-5697-4218-94d0-45ae43bf38de]
azuread_application.argocd: Refreshing state... [id=a147b6df-cb82-4151-b5c8-189df34d4eec]
azuread_group_member.users_administrators: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d/member/64d004bd-9218-4fae-9919-0505ff5eeb8e]
azuread_group_member.users_e2e_nonadmin_user: Refreshing state... [id=aac23af7-2d73-497f-b93c-b8ca4007638d/member/bf9b149f-8a2e-4c4e-bd9b-cfe690aa3c40]
azuread_service_principal.proxmox: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534]
azuread_service_principal.pomerium: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3]
azuread_application_password.cloudflare: Refreshing state... [id=c8f4f59b-5697-4218-94d0-45ae43bf38de/password/f69ce345-3c33-4959-b5ca-67de52396237]
azuread_service_principal.cloudflare: Refreshing state... [id=e86a6d4e-181a-40b5-93a2-134075648512]
azuread_service_principal_delegated_permission_grant.proxmox: Refreshing state... [id=4wfNX-AwD0Oa2nxOHKU1NN_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.proxmox_administrators: Refreshing state... [id=5fcd07e3-30e0-430f-9ada-7c4e1ca53534/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjmWSR3LfvShGqeT89TcYmzg]
azuread_app_role_assignment.pomerium_administrators: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjpYG2T6FzfBCjNOFGI1AQSA]
azuread_app_role_assignment.pomerium_users: Refreshing state... [id=14c0e26a-2834-4be3-97f6-5b82483ecae3/appRoleAssignment/9zrCqnMtf0m5PLjKQAdjjXwUnxsw0OtNuwwrGPLTmGI]
azuread_service_principal_delegated_permission_grant.pomerium: Refreshing state... [id=auLAFDQo40uX9luCSD7K49_iwCu_SpdCpTtOME2nAYc]
azuread_service_principal.argocd: Refreshing state... [id=f95af89e-ff8c-4fd7-972b-6dc6c3cfac00]
cloudflare_access_identity_provider.azuread: Refreshing state... [id=768c6b96-579e-4589-8258-ee9955de7659]
azuread_service_principal_delegated_permission_grant.argocd: Refreshing state... [id=nvha-Yz_10-XK23Gw8-sAN_iwCu_SpdCpTtOME2nAYc]
azuread_app_role_assignment.argocd_administrators: Refreshing state... [id=f95af89e-ff8c-4fd7-972b-6dc6c3cfac00/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjjgwW2WTTslIpqHUh8QCk1k]
cloudflare_access_application.ssh["pve1"]: Refreshing state... [id=ec654f2e-6535-4714-8fdb-f35747f6f516]
cloudflare_access_application.ssh["pve2"]: Refreshing state... [id=313b271e-fe74-4933-94af-35e18c828658]
cloudflare_access_application.ssh["pve3"]: Refreshing state... [id=8e95e45b-b4e3-4828-b579-61a8e8129eff]
cloudflare_access_application.apps["CyberChef"]: Refreshing state... [id=c6049007-dc43-4526-ac50-410919082ea8]
cloudflare_access_application.apps["Homepage"]: Refreshing state... [id=8bd2f815-f49c-465c-878d-7153f5673aa1]
cloudflare_access_application.apps["Kubernetes dashboard"]: Refreshing state... [id=8d91c80e-db2e-430e-a549-60a493f56356]
cloudflare_access_application.apps["Login"]: Refreshing state... [id=67025d24-7bdc-4260-8a79-134ad390e286]
cloudflare_access_application.apps["Proxmox VE"]: Refreshing state... [id=8f6b131e-df37-4158-897d-914c4d330aa2]
cloudflare_access_application.apps["Argo CD"]: Refreshing state... [id=048f6055-e375-4567-95a1-62fad7b8cec6]
azuread_app_role_assignment.cloudflare_administrators: Refreshing state... [id=e86a6d4e-181a-40b5-93a2-134075648512/appRoleAssignment/vQTQZBiSrk-ZGQUF_17rjvRmRtfsitxHg8dWhtqfgQo]
azuread_service_principal_delegated_permission_grant.cloudflare: Refreshing state... [id=Tm1q6BoYtUCTohNAdWSFEt_iwCu_SpdCpTtOME2nAYc]
cloudflare_access_policy.ssh["pve2"]: Refreshing state... [id=721686d0-4e20-4921-8fce-ba62d9647ffc]
cloudflare_access_policy.ssh["pve1"]: Refreshing state... [id=d3e42a8c-7598-410e-9139-dbe2c1e0880e]
cloudflare_access_policy.ssh["pve3"]: Refreshing state... [id=829fdb92-65fd-423d-a692-a1c9c3abe378]
cloudflare_access_policy.apps_administrators["Proxmox VE"]: Refreshing state... [id=1ed0b4ef-5245-4724-824d-eaba7a0e074c]
cloudflare_access_policy.apps_administrators["CyberChef"]: Refreshing state... [id=636005e3-9170-404c-a596-2f89017a1c29]
cloudflare_access_policy.apps_administrators["Kubernetes dashboard"]: Refreshing state... [id=7e793aca-3618-445d-b889-ff445d8a15c4]
cloudflare_access_policy.apps_users["CyberChef"]: Refreshing state... [id=020dacb3-47f0-404e-bf6f-e17ad08a2a63]
cloudflare_access_policy.apps_administrators["Login"]: Refreshing state... [id=af9033a4-948d-4c45-9d18-3fd4327b7bc8]
cloudflare_access_policy.apps_administrators["Argo CD"]: Refreshing state... [id=3afd3528-c745-4075-943f-1aaaefec6c8c]
cloudflare_access_policy.apps_administrators["Homepage"]: Refreshing state... [id=c3a38941-7dfd-4314-9f56-2b66de5eeb62]
cloudflare_access_policy.apps_users["Homepage"]: Refreshing state... [id=0cc3fe93-6d30-4f22-9c7c-ea073f70f60f]
cloudflare_access_policy.apps_users["Login"]: Refreshing state... [id=57e18576-e726-4e26-8c75-24829dbbd155]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_escalation_policy.default will be created
  + resource "pagerduty_escalation_policy" "default" {
      + description = "Default escalation policy for all services"
      + id          = (known after apply)
      + name        = "Default"
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 3
          + id                          = (known after apply)

          + target {
              + id   = "PT33KZP"
              + type = "user_reference"
            }
        }
    }

  # pagerduty_service.proxmox will be created
  + resource "pagerduty_service" "proxmox" {
      + acknowledgement_timeout = "600"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Proxmox VE"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }
    }

  # pagerduty_service_integration.proxmox will be created
  + resource "pagerduty_service_integration" "proxmox" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (sensitive value)
      + integration_key         = (known after apply)
      + name                    = "Proxmox E-mail Alerts"
      + service                 = (known after apply)
      + type                    = "generic_email_inbound_integration"
      + vendor                  = (known after apply)
    }

  # pagerduty_team.default will be created
  + resource "pagerduty_team" "default" {
      + description = "Homecentr Support"
      + html_url    = (known after apply)
      + id          = (known after apply)
      + name        = "Homecentr Support"
    }

  # pagerduty_team_membership.me will be created
  + resource "pagerduty_team_membership" "me" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "PT33KZP"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lholota, Action: `pull_request`*